programming/20230712200139-gitconfig.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-12 Wed 22:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>gitconfig</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">Programming</a>
    <a href="/hacking" class="navbar-filename">Hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
    <a href="/rss.xml" class="navbar-filename">Rss Feed</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">gitconfig</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd0810f5">Git Config</a>
<ul>
<li><a href="#orgbae6843">Common Settings</a>
<ul>
<li><a href="#org822f0a1">User</a></li>
<li><a href="#orgfb82e8c">Gui</a></li>
<li><a href="#org91b2b99">init</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd0810f5" class="outline-2">
<h2 id="orgd0810f5">Git Config</h2>
<div class="outline-text-2" id="text-orgd0810f5">
<p>
You can set the settings for a git repo with the <code>git config</code> command.
</p>

<p>
These settings are written to a file <code>.gitconfig</code> if <code>git config --local</code> is used.
</p>

<p>
You can list settings with <code>git config --list</code>.
</p>
</div>
<div id="outline-container-orgbae6843" class="outline-3">
<h3 id="orgbae6843">Common Settings</h3>
<div class="outline-text-3" id="text-orgbae6843">
</div>
<div id="outline-container-org822f0a1" class="outline-4">
<h4 id="org822f0a1">User</h4>
<div class="outline-text-4" id="text-org822f0a1">
<div class="org-src-container">
<pre class="src src-conf">[<span style="font-weight: bold; text-decoration: underline;">user</span>]
  <span style="font-weight: bold; font-style: italic;">email</span> = example@email.com
  <span style="font-weight: bold; font-style: italic;">name</span> = John Doe
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfb82e8c" class="outline-4">
<h4 id="orgfb82e8c">Gui</h4>
<div class="outline-text-4" id="text-orgfb82e8c">
<p>
Heres how you can set the editor to <a href="../20220428224740-emacs.html#ID-95b6342a-ca5b-4f59-9f08-6cbd3aedf7a2">emacs</a>
</p>
<div class="org-src-container">
<pre class="src src-conf">[<span style="font-weight: bold; text-decoration: underline;">gui</span>]
  <span style="font-weight: bold; font-style: italic;">editor</span> = emacs
</pre>
</div>
</div>
</div>
<div id="outline-container-org91b2b99" class="outline-4">
<h4 id="org91b2b99">init</h4>
<div class="outline-text-4" id="text-org91b2b99">
<p>
If you need to set the default branch heres how you can do so.
</p>
<div class="org-src-container">
<pre class="src src-conf">[<span style="font-weight: bold; text-decoration: underline;">init</span>]
  <span style="font-weight: bold; font-style: italic;">defaultBranch</span> = dev
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
<p class="validation"></p>
</div>
</body>
</html>
